balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F26K22.PIC
        <edc:SFRDef edc:access="nnnnnnrn" edc:cname="TXSTA1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000010" edc:name="TXSTA1" edc:nzwidth="0x8" edc:por="00000010">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TXSTA"/>
            <edc:LegacyAlias edc:cname="TX1STA"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TX9D" edc:desc="" edc:mask="0x1" edc:name="TX9D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRMT" edc:desc="" edc:mask="0x1" edc:name="TRMT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRGH" edc:desc="" edc:mask="0x1" edc:name="BRGH" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SENDB" edc:desc="" edc:mask="0x1" edc:name="SENDB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXEN" edc:desc="" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX9" edc:desc="" edc:mask="0x1" edc:name="TX9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSRC" edc:desc="" edc:mask="0x1" edc:name="CSRC" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TX9D1" edc:desc="" edc:mask="0x1" edc:name="TX9D1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRMT1" edc:desc="" edc:mask="0x1" edc:name="TRMT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRGH1" edc:desc="" edc:mask="0x1" edc:name="BRGH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SENDB1" edc:desc="" edc:mask="0x1" edc:name="SENDB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SYNC1" edc:desc="" edc:mask="0x1" edc:name="SYNC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXEN1" edc:desc="" edc:mask="0x1" edc:name="TXEN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX91" edc:desc="" edc:mask="0x1" edc:name="TX91" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSRC1" edc:desc="" edc:mask="0x1" edc:name="CSRC1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXREG1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TXREG1" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TXREG"/>
            <edc:LegacyAlias edc:cname="TX1REG"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TX1REG" edc:desc="" edc:mask="0xff" edc:name="TX1REG" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXREG" edc:desc="" edc:mask="0xff" edc:name="TXREG" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RCREG1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RCREG1" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="RCREG"/>
            <edc:LegacyAlias edc:cname="RC1REG"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC1REG" edc:desc="" edc:mask="0xff" edc:name="RC1REG" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RCREG" edc:desc="" edc:mask="0xff" edc:name="RCREG" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="rp" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SPBRG1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SPBRG1" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="SPBRG"/>
            <edc:LegacyAlias edc:cname="SP1BRG"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SP1BRG" edc:desc="" edc:mask="0xff" edc:name="SP1BRG" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SPBRG" edc:desc="" edc:mask="0xff" edc:name="SPBRG" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SPBRGH1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SPBRGH1" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="SPBRGH"/>
            <edc:LegacyAlias edc:cname="SP1BRGH"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SP1BRGH" edc:desc="" edc:mask="0xff" edc:name="SP1BRGH" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SPBRGH" edc:desc="" edc:mask="0xff" edc:name="SPBRGH" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T3CON" edc:desc="" edc:impl="0x07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="T3CON" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR3ON" edc:desc="" edc:mask="0x1" edc:name="TMR3ON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3RD16" edc:desc="" edc:mask="0x1" edc:name="T3RD16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="nT3SYNC" edc:desc="" edc:mask="0x1" edc:name="nT3SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3SOSCEN" edc:desc="" edc:mask="0x1" edc:name="T3SOSCEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3CKPS" edc:desc="" edc:mask="0x3" edc:name="T3CKPS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TMR3CS" edc:desc="" edc:mask="0x3" edc:name="TMR3CS" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="T3OSCEN" edc:desc="" edc:mask="0x1" edc:name="T3OSCEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3CKPS0" edc:desc="" edc:mask="0x1" edc:name="T3CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3CKPS1" edc:desc="" edc:mask="0x1" edc:name="T3CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR3CS0" edc:desc="" edc:mask="0x1" edc:name="TMR3CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR3CS1" edc:desc="" edc:mask="0x1" edc:name="TMR3CS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="TMR3" edc:desc="" edc:name="TMR3" edc:nzwidth="0x10">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR3" edc:desc="" edc:mask="0xffff" edc:name="TMR3" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR3L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR3L" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR3L" edc:desc="" edc:mask="0xff" edc:name="TMR3L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR3H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR3H" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR3H" edc:desc="" edc:mask="0xff" edc:name="TMR3H" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnrnn" edc:cname="T3GCON" edc:desc="" edc:impl="0x07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000x00" edc:name="T3GCON" edc:nzwidth="0x8" edc:por="00000x00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T3GSS" edc:desc="" edc:mask="0x3" edc:name="T3GSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="T3GVAL" edc:desc="" edc:mask="0x1" edc:name="T3GVAL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3GGO_nDONE" edc:desc="" edc:mask="0x1" edc:name="T3GGO/nDONE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3GSPM" edc:desc="" edc:mask="0x1" edc:name="T3GSPM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3GTM" edc:desc="" edc:mask="0x1" edc:name="T3GTM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3GPOL" edc:desc="" edc:mask="0x1" edc:name="T3GPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR3GE" edc:desc="" edc:mask="0x1" edc:name="TMR3GE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T3GSS0" edc:desc="" edc:mask="0x1" edc:name="T3GSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3GSS1" edc:desc="" edc:mask="0x1" edc:name="T3GSS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T3G_DONE" edc:desc="" edc:mask="0x1" edc:name="T3G_DONE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="T3GGO" edc:desc="" edc:mask="0x1" edc:name="T3GGO" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ECCP1AS" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ECCP1AS" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="ECCPAS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="P1SSBD" edc:desc="" edc:mask="0x3" edc:name="PSS1BD" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="P1SSAC" edc:desc="" edc:mask="0x3" edc:name="PSS1AC" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="CCP1AS" edc:desc="" edc:mask="0x7" edc:name="CCP1AS" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="CCP1ASE" edc:desc="" edc:mask="0x1" edc:name="CCP1ASE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="P1SSBD0" edc:desc="" edc:mask="0x1" edc:name="PSS1BD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1SSBD1" edc:desc="" edc:mask="0x1" edc:name="PSS1BD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1SSAC0" edc:desc="" edc:mask="0x1" edc:name="PSS1AC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1SSAC1" edc:desc="" edc:mask="0x1" edc:name="PSS1AC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1AS0" edc:desc="" edc:mask="0x1" edc:name="CCP1AS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1AS1" edc:desc="" edc:mask="0x1" edc:name="CCP1AS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1AS2" edc:desc="" edc:mask="0x1" edc:name="CCP1AS2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PSS1BD" edc:desc="" edc:mask="0x3" edc:name="PSS1BD" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PSS1AC" edc:desc="" edc:mask="0x3" edc:name="PSS1AC" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="PSS1BD0" edc:desc="" edc:mask="0x1" edc:name="PSS1BD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS1BD1" edc:desc="" edc:mask="0x1" edc:name="PSS1BD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS1AC0" edc:desc="" edc:mask="0x1" edc:name="PSS1AC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS1AC1" edc:desc="" edc:mask="0x1" edc:name="PSS1AC1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="PSSBD" edc:desc="" edc:mask="0x3" edc:name="PSSBD" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PSSAC" edc:desc="" edc:mask="0x3" edc:name="PSSAC" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="ECCPAS" edc:desc="" edc:mask="0x7" edc:name="ECCPAS" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="ECCPASE" edc:desc="" edc:mask="0x1" edc:name="ECCPASE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:SFRFieldDef edc:cname="PSSBD0" edc:desc="" edc:mask="0x1" edc:name="PSSBD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSSBD1" edc:desc="" edc:mask="0x1" edc:name="PSSBD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSSAC0" edc:desc="" edc:mask="0x1" edc:name="PSSAC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSSAC1" edc:desc="" edc:mask="0x1" edc:name="PSSAC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ECCPAS0" edc:desc="" edc:mask="0x1" edc:name="ECCPAS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ECCPAS1" edc:desc="" edc:mask="0x1" edc:name="ECCPAS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ECCPAS2" edc:desc="" edc:mask="0x1" edc:name="ECCPAS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM1CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM1CON" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="PWMCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="P1DC" edc:desc="" edc:mask="0x7f" edc:name="P1DC" edc:nzwidth="7"/>
              <edc:SFRFieldDef edc:cname="P1RSEN" edc:desc="" edc:mask="0x1" edc:name="P1RSEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="P1DC0" edc:desc="" edc:mask="0x1" edc:name="P1DC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P1DC1" edc:desc="" edc:mask="0x1" edc:name="P1DC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P1DC2" edc:desc="" edc:mask="0x1" edc:name="P1DC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P1DC3" edc:desc="" edc:mask="0x1" edc:name="P1DC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P1DC4" edc:desc="" edc:mask="0x1" edc:name="P1DC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P1DC5" edc:desc="" edc:mask="0x1" edc:name="P1DC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P1DC6" edc:desc="" edc:mask="0x1" edc:name="P1DC6" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PDC" edc:desc="" edc:mask="0x7f" edc:name="PDC" edc:nzwidth="7"/>
              <edc:SFRFieldDef edc:cname="PRSEN" edc:desc="" edc:mask="0x1" edc:name="PRSEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="PDC0" edc:desc="" edc:mask="0x1" edc:name="PDC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDC1" edc:desc="" edc:mask="0x1" edc:name="PDC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDC2" edc:desc="" edc:mask="0x1" edc:name="PDC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDC3" edc:desc="" edc:mask="0x1" edc:name="PDC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDC4" edc:desc="" edc:mask="0x1" edc:name="PDC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDC5" edc:desc="" edc:mask="0x1" edc:name="PDC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDC6" edc:desc="" edc:mask="0x1" edc:name="PDC6" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nrnnn-nn" edc:cname="BAUDCON1" edc:desc="" edc:impl="0xdb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="01000-00" edc:name="BAUDCON1" edc:nzwidth="0x8" edc:por="01000-00">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="BAUDCON"/>
            <edc:LegacyAlias edc:cname="BAUDCTL"/>
            <edc:LegacyAlias edc:cname="BAUD1CON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ABDEN" edc:desc="" edc:mask="0x1" edc:name="ABDEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WUE" edc:desc="" edc:mask="0x1" edc:name="WUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="BRG16" edc:desc="" edc:mask="0x1" edc:name="BRG16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKTXP" edc:desc="" edc:mask="0x1" edc:name="CKTXP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTRXP" edc:desc="" edc:mask="0x1" edc:name="DTRXP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RCIDL" edc:desc="" edc:mask="0x1" edc:name="RCIDL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABDOVF" edc:desc="" edc:mask="0x1" edc:name="ABDOVF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SCKP" edc:desc="" edc:mask="0x1" edc:name="SCKP" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="PSTR1CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00001" edc:name="PSTR1CON" edc:nzwidth="0x8" edc:por="---00001">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="PSTRCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STR1A" edc:desc="" edc:mask="0x1" edc:name="STR1A" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:desc="" edc:when="STRA"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="STR1B" edc:desc="" edc:mask="0x1" edc:name="STR1B" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:desc="" edc:when="STRB"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="STR1C" edc:desc="" edc:mask="0x1" edc:name="STR1C" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:desc="" edc:when="STRC"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="STR1D" edc:desc="" edc:mask="0x1" edc:name="STR1D" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:desc="" edc:when="STRC"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="STR1SYNC" edc:desc="" edc:mask="0x1" edc:name="STR1SYNC" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:desc="" edc:when="STRSYNC"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="T2CON" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="T2CON" edc:nzwidth="0x8" edc:por="-0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T2CKPS" edc:desc="" edc:mask="0x3" edc:name="T2CKPS" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TMR2ON" edc:desc="" edc:mask="0x1" edc:name="TMR2ON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2OUTPS" edc:desc="" edc:mask="0xf" edc:name="T2OUTPS" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T2CKPS0" edc:desc="" edc:mask="0x1" edc:name="T2CKPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2CKPS1" edc:desc="" edc:mask="0x1" edc:name="T2CKPS1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T2OUTPS0" edc:desc="" edc:mask="0x1" edc:name="T2OUTPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2OUTPS1" edc:desc="" edc:mask="0x1" edc:name="T2OUTPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2OUTPS2" edc:desc="" edc:mask="0x1" edc:name="T2OUTPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2OUTPS3" edc:desc="" edc:mask="0x1" edc:name="T2OUTPS3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
